import {data} from './data.js';
//Это у нас пришло с фетча


//Здесь ты по инпуту ищешь
function searchProducts() {



}

searchProducts();

//здесь ты рендеришь результат
function renderProducts(items) {

}

renderProducts(data);


//сделать кнопку которая будет показывать только те что в наличии , inStock - true
// сделать фильтр по цене ( инпут интеджерс , с числами )
// накинуть красивый фронт энд , с сет таймаутом на прелоадер
// вывести все категории, кнопками и проводить по ним фильттрацию